[
  {
    "name": "Hamburger Steaks",
    "description": "Savory hamburger patties smothered in a rich onion and bell pepper gravy.",
    "prepTime": 15,
    "cookTime": 25,
    "servings": 4,
    "ingredients": "Ground beef; Bell peppers; Onions",
    "instructions": "Form ground beef into patties; Brown patties in a skillet; Sauté bell peppers and onions; Combine patties and vegetables with gravy and simmer until cooked through.",
    "category": "Entrees/Meats"
  },
  {
    "name": "Meatloaf (Faye's)",
    "description": "A classic comfort food with a unique flavor from tomato soup and stuffing mix.",
    "prepTime": 15,
    "cookTime": 60,
    "servings": 6,
    "ingredients": "Ground beef; Stuffing mix; Tomato soup; Egg",
    "instructions": "Combine all ingredients in a large bowl; Shape into a loaf and place in a baking dish; Bake until cooked through and firm.",
    "category": "Entrees/Meats"
  },
  {
    "name": "Meatloaf (Mavis')",
    "description": "A flavorful meatloaf with a tangy ketchup and brown sugar glaze.",
    "prepTime": 20,
    "cookTime": 75,
    "servings": 8,
    "ingredients": "Ground beef; Onion; Bell pepper; Diced tomatoes; Oats; Egg; Ketchup; Brown sugar; Mustard",
    "instructions": "Mix ground beef with vegetables, oats, and egg; Form into a loaf; Prepare a glaze with ketchup, brown sugar, and mustard; Spread glaze over meatloaf before baking.",
    "category": "Entrees/Meats"
  },
  {
    "name": "Mexican Chicken Casserole",
    "description": "This creamy, cheesy, one-dish meal is a perfect weeknight dinner that’s packed with flavor.",
    "prepTime": 15,
    "cookTime": 30,
    "servings": 5,
    "ingredients": "Chicken breast; Cream cheese; Rotel; Onion; Shredded cheese; Taco seasoning; Corn/tortilla chips",
    "instructions": "Preheat oven; Cook and shred chicken; Combine chicken with cream cheese, Rotel, onion, cheese, and seasoning; Bake until hot and bubbly; Top with crushed chips and bake for a few more minutes.",
    "category": "Casseroles"
  },
  {
    "name": "Poppyseed Chicken",
    "description": "A rich and savory chicken casserole with a buttery, crunchy Ritz cracker topping.",
    "prepTime": 10,
    "cookTime": 30,
    "servings": 6,
    "ingredients": "Chicken breast; Poppyseed; Sour cream; Lemon juice; Cream of chicken soup; Ritz crackers; Butter",
    "instructions": "Cook and shred chicken; Combine chicken with poppy seeds, sour cream, lemon juice, and cream of chicken soup; Place mixture in a baking dish; Top with crushed Ritz crackers mixed with melted butter; Bake until golden and bubbly.",
    "category": "Casseroles"
  },
  {
    "name": "Chicken & Dumplings",
    "description": "A comforting, classic chicken and dumplings dish with a flavorful broth.",
    "prepTime": 20,
    "cookTime": 90,
    "servings": 8,
    "ingredients": "Whole chicken; Flour; Baking soda; Crisco",
    "instructions": "Boil a whole chicken to create a rich broth; Shred chicken and set aside; Prepare a dumpling dough with flour, baking soda, and crisco; Drop dumplings into the simmering broth; Cook until dumplings are tender and cooked through.",
    "category": "One-dish Meals"
  },
  {
    "name": "Curry Chicken",
    "description": "A simple and delicious Filipino-style curry with tender chicken and creamy coconut milk.",
    "prepTime": 15,
    "cookTime": 30,
    "servings": 4,
    "ingredients": "Chicken thighs; Coconut milk; Bell pepper; Curry powder; Rice",
    "instructions": "Sauté chicken thighs until browned; Add curry powder and bell peppers; Stir in coconut milk and simmer until sauce has thickened; Serve over a bed of steamed rice.",
    "category": "Filipino"
  },
  {
    "name": "Adobo",
    "description": "A traditional Filipino dish with chicken stewed in a tangy and savory blend of soy sauce and vinegar.",
    "prepTime": 10,
    "cookTime": 45,
    "servings": 4,
    "ingredients": "Chicken thighs; White vinegar; Soy sauce; Sugar; Garlic; Onion; Bay leaves; Rice",
    "instructions": "Marinate chicken in soy sauce and vinegar with spices; Brown chicken; Simmer chicken with remaining marinade, garlic, onion, and bay leaves until chicken is tender; Serve with steamed rice.",
    "category": "Filipino"
  },
  {
    "name": "Hot Links, Peppers, & Onions",
    "description": "A quick and easy stir-fry with spicy hot links, bell peppers, and onions.",
    "prepTime": 5,
    "cookTime": 20,
    "servings": 4,
    "ingredients": "Hot links; Bell peppers; Onions; Vegetable oil",
    "instructions": "Slice hot links, bell peppers, and onions; Sauté vegetables in vegetable oil until soft; Add sliced hot links and cook until browned; Serve hot.",
    "category": "One-dish Meals"
  },
  {
    "name": "Jambalaya",
    "description": "A classic one-pot rice dish with a medley of ground beef and vegetables in a flavorful tomato base.",
    "prepTime": 15,
    "cookTime": 45,
    "servings": 6,
    "ingredients": "Rice; Ground beef; Rotel; Garlic; Onion; Tomato paste; Tomato sauce; Bell pepper; Green onions",
    "instructions": "Brown ground beef with onion and garlic; Add bell pepper and cook until soft; Stir in tomato paste, tomato sauce, and Rotel; Add rice and water and simmer until rice is cooked through; Garnish with green onions.",
    "category": "One-dish Meals"
  },
  {
    "name": "Carnitas",
    "description": "Tender, crispy Mexican pulled pork perfect for tacos or burritos.",
    "prepTime": 15,
    "cookTime": 240,
    "servings": 8,
    "ingredients": "Pork shoulder/butt; Taco seasoning; Onions; Cheese dip; Sour cream; Avocados; Lime juice; Shredded cheese; Lettuce; Corn/tortilla chips",
    "instructions": "Rub pork shoulder with taco seasoning and onions; Slow cook until pork is tender; Shred pork and pan-fry to create crispy edges; Serve with toppings.",
    "category": "Mexican"
  },
  {
    "name": "Enchiladas",
    "description": "Corn tortillas filled with chicken or beef, smothered in enchilada sauce and cheese.",
    "prepTime": 20,
    "cookTime": 30,
    "servings": 6,
    "ingredients": "Chicken breast or ground beef; Taco seasoning; Onions; Tortillas; Enchilada sauce; Shredded cheese",
    "instructions": "Cook chicken or ground beef with onions and taco seasoning; Fill tortillas with the meat mixture; Arrange filled tortillas in a baking dish; Pour enchilada sauce over top and sprinkle with cheese; Bake until cheese is melted and bubbly.",
    "category": "Mexican"
  },
  {
    "name": "Fajitas",
    "description": "Sizzling strips of chicken, bell peppers, and onions, served with a variety of toppings.",
    "prepTime": 15,
    "cookTime": 20,
    "servings": 4,
    "ingredients": "Chicken breast; Taco seasoning; Onions; Bell peppers; Cheese dip; Sour cream; Avocados; Lime juice; Shredded cheese; Lettuce; Corn/tortilla chips",
    "instructions": "Slice chicken, bell peppers, and onions; Sauté in a skillet with taco seasoning until tender; Serve sizzling with all the toppings on the side.",
    "category": "Mexican"
  },
  {
    "name": "Street Tacos",
    "description": "Authentic-style tacos with tender Philly steak, fresh onions, and cilantro.",
    "prepTime": 10,
    "cookTime": 15,
    "servings": 4,
    "ingredients": "Philly steak meat; Onions; Cilantro; Tomatoes; Sour cream; Avocados; Lime juice; Tortillas",
    "instructions": "Sauté Philly steak meat with onions; Warm tortillas; Assemble tacos with meat, onions, cilantro, and tomatoes; Top with sour cream, avocados, and a squeeze of lime juice.",
    "category": "Mexican"
  },
  {
    "name": "Taco Salad",
    "description": "A delicious and customizable salad with seasoned ground beef and all your favorite taco toppings.",
    "prepTime": 10,
    "cookTime": 15,
    "servings": 4,
    "ingredients": "Ground beef; Taco seasoning; Onions; Cheese dip; Sour cream; Avocados; Lime juice; Shredded cheese; Lettuce; Spanish peanuts; Corn/tortilla chips",
    "instructions": "Brown ground beef with onions and taco seasoning; Layer lettuce and other toppings in a bowl; Top with the warm meat and serve with chips.",
    "category": "Mexican"
  },
  {
    "name": "New England Boiled Dinner",
    "description": "A hearty, one-pot meal with savory ham and tender vegetables.",
    "prepTime": 10,
    "cookTime": 120,
    "servings": 8,
    "ingredients": "Ham; Cabbage; Potatoes; Carrots",
    "instructions": "Place ham in a large pot with water; Bring to a boil and simmer; Add potatoes, carrots, and cabbage; Cook until all vegetables are tender.",
    "category": "One-dish Meals"
  },
  {
    "name": "Pork Chops & Rice",
    "description": "Tender pork chops baked with instant rice and creamy mushroom soup.",
    "prepTime": 10,
    "cookTime": 45,
    "servings": 4,
    "ingredients": "Pork chops; Instant rice; Cream of mushroom soup",
    "instructions": "Brown pork chops; Place rice in a baking dish; Top with pork chops and cream of mushroom soup mixed with water; Bake until pork chops are cooked through and rice is tender.",
    "category": "One-dish Meals"
  },
  {
    "name": "Roast",
    "description": "A classic pot roast slow-cooked with carrots, potatoes, and onions for a tender, flavorful meal.",
    "prepTime": 15,
    "cookTime": 240,
    "servings": 6,
    "ingredients": "Roast; Onions; Potatoes; Carrots; Pot roast packet",
    "instructions": "Sear roast on all sides; Place roast in a slow cooker or pot with potatoes, carrots, onions, and seasoning packet; Slow cook until meat is fork-tender.",
    "category": "One-dish Meals"
  },
  {
    "name": "Sausage & Green Beans",
    "description": "A quick and savory stir-fry of sausage, green beans, and soy sauce served over rice.",
    "prepTime": 5,
    "cookTime": 20,
    "servings": 4,
    "ingredients": "Sausage; Green beans; Soy sauce; Rice",
    "instructions": "Cook sausage; Add green beans and soy sauce to the skillet; Sauté until green beans are cooked; Serve over a bed of steamed rice.",
    "category": "One-dish Meals"
  },
  {
    "name": "Spaghetti",
    "description": "A simple and satisfying spaghetti dish with a rich, seasoned meat sauce.",
    "prepTime": 10,
    "cookTime": 30,
    "servings": 6,
    "ingredients": "Spaghetti noodles or squash; Ground beef; Spaghetti sauce; Tomato paste; Tomato sauce; Seasoning: salt, pepper, garlic powder, brown sugar, Italian seasoning",
    "instructions": "Brown ground beef; Add spaghetti sauce, tomato paste, tomato sauce, and seasonings; Simmer for at least 20 minutes; Serve over cooked spaghetti noodles or squash.",
    "category": "One-dish Meals"
  },
  {
    "name": "Stir Fry",
    "description": "A quick and easy stir-fry with chicken and mixed vegetables in a savory sauce.",
    "prepTime": 15,
    "cookTime": 20,
    "servings": 4,
    "ingredients": "Chicken; Broccoli; Stir-fry sauce; Rice; Soy sauce; Fried rice seasoning packet; Mixed vegetables; Onions",
    "instructions": "Cook rice; Sauté chicken until cooked through; Add vegetables and cook until tender-crisp; Add stir-fry sauce and seasonings and cook until heated through; Serve over rice.",
    "category": "One-dish Meals"
  },
  {
    "name": "Zucchini Lasagna",
    "description": "A low-carb alternative to traditional lasagna, made with zucchini noodles and a cheesy beef filling.",
    "prepTime": 20,
    "cookTime": 45,
    "servings": 6,
    "ingredients": "Zucchini; Cream cheese; Eggs; Mozzarella cheese; Shredded parmesan; Ground beef; Garlic; Tomato paste; Tomato sauce",
    "instructions": "Brown ground beef with garlic; Create a creamy cheese filling by mixing cream cheese, eggs, mozzarella, and parmesan; Slice zucchini thin; Layer zucchini, meat sauce, and cheese filling in a baking dish; Bake until bubbly and golden.",
    "category": "One-dish Meals"
  },
  {
    "name": "BLT",
    "description": "A classic sandwich with crispy bacon, fresh lettuce, and ripe tomatoes.",
    "prepTime": 5,
    "cookTime": 10,
    "servings": 1,
    "ingredients": "Bread; Bacon; Sliced cheese; Lettuce; Tomatoes; Mayo",
    "instructions": "Cook bacon until crispy; Toast bread; Assemble the sandwich with mayo, lettuce, tomatoes, bacon, and cheese.",
    "category": "Sandwiches"
  },
  {
    "name": "Breakfast Toasters",
    "description": "A warm, cheesy breakfast sandwich with bacon and egg.",
    "prepTime": 5,
    "cookTime": 10,
    "servings": 1,
    "ingredients": "Bread; Bacon; Eggs; Sliced cheese",
    "instructions": "Cook bacon and egg; Toast bread; Assemble the sandwich with bacon, egg, and cheese.",
    "category": "Sandwiches"
  },
  {
    "name": "Burgers",
    "description": "A juicy ground beef burger with classic toppings on a toasted bun.",
    "prepTime": 10,
    "cookTime": 15,
    "servings": 1,
    "ingredients": "Buns; Ground beef; Onion; Ketchup; Mustard; Mayo; Sliced cheese",
    "instructions": "Form ground beef into a patty; Cook to desired doneness; Toast buns; Assemble burger with toppings.",
    "category": "Sandwiches"
  },
  {
    "name": "Grown-Up Grilled Cheese",
    "description": "A gourmet grilled cheese with a mix of cheeses and a hint of Caesar dressing.",
    "prepTime": 5,
    "cookTime": 10,
    "servings": 1,
    "ingredients": "Bread; Butter; Caesar dressing; Sliced cheddar cheese; Feta cheese; Shredded parmesan cheese",
    "instructions": "Butter one side of each slice of bread; Place one slice butter-side down in a skillet; Add cheese and Caesar dressing; Top with the second slice of bread, butter-side up; Grill until golden brown and cheese is melted.",
    "category": "Sandwiches"
  },
  {
    "name": "Hot Ham & Cheese",
    "description": "A warm, satisfying sandwich with ham and melted cheese.",
    "prepTime": 5,
    "cookTime": 10,
    "servings": 1,
    "ingredients": "Bread; Butter; Ham; Sliced cheese",
    "instructions": "Butter bread; Place ham and cheese between bread slices; Pan-fry or grill until cheese is melted.",
    "category": "Sandwiches"
  },
  {
    "name": "Philly Steaks",
    "description": "A classic Philly steak sandwich with provolone cheese, onions, and peppers on a sub roll.",
    "prepTime": 10,
    "cookTime": 15,
    "servings": 2,
    "ingredients": "Buns; Philly steak; Sliced provolone cheese; Onions; Peppers; Butter; Cavender’s",
    "instructions": "Sauté sliced onions and peppers until soft; Add Philly steak to the skillet and cook until done; Top with provolone cheese until melted; Serve on warm buns.",
    "category": "Sandwiches"
  },
  {
    "name": "Reubens",
    "description": "A classic deli sandwich with corned beef, sauerkraut, Swiss cheese, and Thousand Island dressing on rye bread.",
    "prepTime": 5,
    "cookTime": 10,
    "servings": 1,
    "ingredients": "Rye bread; Butter; Corned beef; Sliced Swiss cheese; Thousand Island dressing; Sauerkraut",
    "instructions": "Butter one side of rye bread slices; Place one slice butter-side down in a skillet; Top with corned beef, sauerkraut, Swiss cheese, and Thousand Island dressing; Top with the second slice of bread, butter-side up; Grill until golden brown and cheese is melted.",
    "category": "Sandwiches"
  },
  {
    "name": "Beef Stew",
    "description": "A hearty and comforting beef stew with tender chunks of meat and vegetables.",
    "prepTime": 15,
    "cookTime": 180,
    "servings": 6,
    "ingredients": "Stew meat; Potatoes; Carrots; Onions; Beef stew packet",
    "instructions": "Brown stew meat; Add meat and vegetables to a pot with a beef stew seasoning packet and water; Simmer on low heat until meat is very tender and vegetables are soft.",
    "category": "Soups & Stews"
  },
  {
    "name": "Taco Soup",
    "description": "A simple and flavorful soup with a taco twist, topped with cheese and sour cream.",
    "prepTime": 10,
    "cookTime": 30,
    "servings": 6,
    "ingredients": "Ground beef; Black beans; Pinto beans; Corn; Rotel; Crushed tomatoes; Taco seasoning; Onions; Sour cream; Shredded cheese; Corn/tortilla chips",
    "instructions": "Brown ground beef with onions; Drain excess fat; Add all remaining soup ingredients to a large pot and simmer; Top with cheese and sour cream when serving.",
    "category": "Soups & Stews"
  },
  {
    "name": "Chili",
    "description": "A rich and savory chili with a blend of seasonings and tomatoes.",
    "prepTime": 15,
    "cookTime": 60,
    "servings": 8,
    "ingredients": "Ground beef; Chili starter; Onions; Tomato paste; Tomato sauce; Rotel; Crushed tomatoes; Chili seasoning; Shredded cheese; Corn chips",
    "instructions": "Brown ground beef and onions; Add all tomato ingredients and seasoning to the pot; Simmer on low heat for at least an hour to let the flavors meld.",
    "category": "Soups & Stews"
  },
  {
    "name": "White Chicken Chili",
    "description": "A creamy and hearty chili with chicken and white beans.",
    "prepTime": 15,
    "cookTime": 45,
    "servings": 6,
    "ingredients": "Chicken breast or whole chicken; Onion; Pinto beans; White chicken chili packet; Shredded cheese; Corn chips",
    "instructions": "Cook and shred chicken; Sauté onions; Combine chicken, onions, beans, and seasoning packet in a pot; Simmer until heated through; Top with cheese and corn chips.",
    "category": "Soups & Stews"
  }
]